nicolas-codemate/esp32-pixelcast/src/main.cpp
uint32_t dimColorQuarter(uint32_t color);
char utf8FrenchToAscii(uint8_t leadByte, uint8_t continuationByte);
int16_t calculateTextWidth(const char* text);
int16_t calculateTomThumbTextWidth(const char* text);
void resetScrollState();
void resetTrackerScrollStates();
bool scrollStateAdvance(ScrollState& state, unsigned long now);
void scrollStateArm(ScrollState& state, int16_t textWidth, int16_t availableWidth);
void scrollStateReset(ScrollState& state);

int pngDrawCallback(PNGDRAW *pDraw);
CachedIcon* loadIcon(const char* name);
CachedIcon* getIcon(const char* name);
CachedIcon* getCachedIcon(const char* name);
int8_t findLRUSlot();
void drawIcon(CachedIcon* icon, int16_t x, int16_t y);
void initIconCache();
void invalidateCachedIcon(const char* name);
bool validatePngHeader(const uint8_t* data, size_t len);
bool validateGifHeader(const uint8_t* data, size_t len);
bool downloadLaMetricIcon(uint32_t iconId, const char* saveName);
void handleApiIconsList(AsyncWebServerRequest *request);
void handleApiIconsServe(AsyncWebServerRequest *request, const String& name);
void handleApiIconsDelete(AsyncWebServerRequest *request);

bool loadSettings();
bool saveSettings();
void initDefaultSettings();
void printTextWithSpecialChars(const char* text, int16_t x, int16_t y);
bool ensureDirectories();
bool loadApps();
bool saveApps();

void weatherParseTodayBlock(JsonObjectConst todayBlock);
void weatherClockApplyDuration(uint16_t durationMs);

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint16_t duration,
              uint32_t lifetime, int8_t priority, bool isSystem);
bool appRemove(const char* id);
bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor);
int8_t appFind(const char* id);
void appCleanExpired();
AppItem* appGetNext();
AppItem* appGetCurrent();
void appSetZones(int8_t appIndex, JsonArray zonesArray);
void displayShowMultiZone(AppItem* app);
void displayShowZone(AppZone* zone, int16_t x, int16_t y, int16_t w, int16_t h);

// Tracker management
TrackerData* trackerFind(const char* name);
TrackerData* trackerAllocate(const char* name);
bool trackerRemove(const char* name);
void trackerInit();
void displayShowTracker(TrackerData* tracker);
void displayDrawTrackerSymbol(TrackerData* tracker, bool isStale);
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color);
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color);
void formatTrackerValue(float value, char* buffer, size_t bufSize);
uint32_t parseColorValue(JsonVariant colorVar, uint32_t defaultColor);
void formatColorHex(uint32_t color, char* buffer, size_t bufSize);
void parseTextFieldWithSegments(JsonVariant field, char* textBuffer, size_t textBufferSize,
                                TextSegment* segments, uint8_t* segmentCount, uint32_t defaultColor);
void serializeTextField(JsonObject& obj, const char* fieldName, const char* text,
                        const TextSegment* segments, uint8_t segmentCount);
void printTextWithSegments(const char* text, int16_t x, int16_t y,
                           uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount);
void printLabelWithSegments(const char* text, int16_t x, int16_t y,
                            uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount,
                            bool dimDefault);
void printTextWithinBounds(const char* text, int16_t x, int16_t y,
                           int16_t boundLeft, int16_t boundRight, uint32_t color);
void drawCharacterWithinBounds(char character, int16_t x, int16_t y,
                               int16_t boundLeft, int16_t boundRight, uint16_t color);

// Notification management
void notifInit();
int8_t notifAdd(const char* id, const char* text, const char* icon,
                uint32_t textColor, uint32_t bgColor, uint16_t duration,
                bool hold, bool urgent, bool stack);
bool notifDismiss();
void notifClearAll();
NotificationItem* notifGetCurrent();
NotificationItem* notifGetNext();
bool notifIsExpired(NotificationItem* notif);
void displayShowNotification(NotificationItem* notif);
void resetNotifScrollState();

// Indicator management
void indicatorInit();
void indicatorSet(uint8_t index, IndicatorMode mode, uint32_t color,
                  uint16_t blinkInterval, uint16_t fadePeriod);
void indicatorOff(uint8_t index);
void drawIndicators();
bool indicatorNeedsRedraw();
void handleIndicatorApi(AsyncWebServerRequest *request, JsonVariant &json, uint8_t index);

void mqttCallback(char* topic, byte* payload, unsigned int length);
bool mqttConnect();
void mqttPublishStats();
void mqttHandleCustom(const char* name, JsonObject& doc);
void mqttHandleCustomDelete(const char* name);
void mqttHandleNotify(JsonObject& doc);
void mqttHandleDismiss();
void mqttHandleIndicator(uint8_t index, JsonObject& doc);
void mqttHandleWeather(JsonObject& doc);
void mqttHandleTracker(const char* name, JsonObject& doc);
void mqttHandleTrackerDelete(const char* name);
void mqttHandleSettings(JsonObject& doc);
void mqttHandleBrightness(JsonObject& doc);
void mqttHandleReboot();

void handleApiStats(AsyncWebServerRequest *request);
void handleApiSettings(AsyncWebServerRequest *request);
void handleApiApps(AsyncWebServerRequest *request);

void logMemory();

bool sleepIsActive();
static bool dayIndexFromName(const char* name, uint8_t& outIndex);
static const char* dayNameFromIndex(uint8_t index);
static bool parseHourMinute(const char* text, uint8_t& outHour, uint8_t& outMinute);
static void formatHourMinute(uint8_t hour, uint8_t minute, char* out, size_t outSize);
static const char* sleepReasonToString(SleepReason reason);
static void buildSleepConfigJson(JsonObject root);
static bool applySleepUpdate(JsonObject body, String& errorOut);
static void wakeNow();

// ============================================================================
// Setup
// ============================================================================

void setup() {
    Serial.begin(115200);
    delay(100);

    Serial.println();
    Serial.println("========================================");
    Serial.println("   ESP32-PixelCast v" VERSION_STRING);
    Serial.println("   HUB75 LED Matrix Display Firmware");
    Serial.println("========================================");
    Serial.println();

    logMemory();

    Serial.println("[INIT] Setting up display...");
    setupDisplay();
    displayShowBoot();

    Serial.println("[INIT] Setting up filesystem...");
    setupFilesystem();

    // Initialize weather data as empty
    memset(&weatherData, 0, sizeof(weatherData));

