nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Initialize tracker system
    trackerInit();

    // Initialize notification system
    notifInit();

    // Initialize indicator system (defaults set before loadSettings overrides)
    indicatorInit();

    Serial.println("[INIT] Loading settings...");
    if (!loadSettings()) {
        Serial.println("[INIT] Using default settings");
        initDefaultSettings();
    }
    displaySetBrightness(settings.brightness);

    Serial.println("[INIT] Setting up WiFi...");
    setupWiFi();

    if (wifiConnected) {
        Serial.println("[INIT] Setting up mDNS...");
        setupMDNS();

        Serial.println("[INIT] Setting up web server...");
        setupWebServer();

        Serial.println("[INIT] Setting up MQTT...");
        setupMQTT();

        Serial.println("[INIT] Setting up OTA...");
        ArduinoOTA.setHostname(MDNS_NAME);
        ArduinoOTA.onStart([]() {
            Serial.println("[OTA] Update starting...");
            dma_display->fillScreen(0);
            dma_display->setTextSize(1);
            dma_display->setTextColor(dma_display->color565(255, 165, 0));
            // "OTA" default font, centered (3 chars x 6px = 18px)
            dma_display->setCursor(23, 4);
            dma_display->print("OTA");
            // "UPDATE" same font, centered (6 chars x 6px = 36px)
            dma_display->setCursor(14, 18);
            dma_display->print("UPDATE");
            // Progress bar frame near bottom
            dma_display->drawRect(4, 46, 56, 7, dma_display->color565(80, 80, 80));
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
            static uint8_t lastPercent = 255;
            uint8_t percent = (uint8_t)((progress * 100) / total);
            // Only redraw every 5% to avoid slowing down OTA transfer
            if (percent == lastPercent || (percent % 5 != 0 && percent != 100)) return;
            lastPercent = percent;
            uint8_t barWidth = (uint8_t)((progress * 54) / total);
            if (barWidth > 0) {
                dma_display->fillRect(5, 47, barWidth, 5,
                    dma_display->color565(255, 165, 0));
            }
            dma_display->fillRect(0, 56, 64, 8, 0);
            char buf[8];
            snprintf(buf, sizeof(buf), "%d%%", percent);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(150, 150, 150));
            int16_t textW = strlen(buf) * 4;
            dma_display->setCursor((64 - textW) / 2, 60);
            dma_display->print(buf);
            dma_display->setFont(NULL);
        });
        ArduinoOTA.onEnd([]() {
            Serial.println("[OTA] Update complete!");
            dma_display->fillScreen(0);
            dma_display->setTextColor(dma_display->color565(0, 255, 0));
            dma_display->setCursor(13, 24);
            dma_display->print("DONE");
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(dma_display->color565(100, 100, 100));
            dma_display->setCursor(8, 38);
            dma_display->print("Rebooting...");
            dma_display->setFont(NULL);
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.onError([](ota_error_t error) {
            Serial.printf("[OTA] Error[%u]\n", error);
            dma_display->fillScreen(0);
            dma_display->setTextColor(dma_display->color565(255, 0, 0));
            dma_display->setCursor(7, 28);
            dma_display->print("OTA ERR");
            #if DOUBLE_BUFFER
                dma_display->flipDMABuffer();
            #endif
        });
        ArduinoOTA.begin();

        Serial.println("[INIT] Setting up NTP...");
        configTzTime(settings.tzPosix, settings.ntpServer);

        displayShowIP();
        delay(2000);

        Serial.println("[INIT] Initializing icon cache...");
        initIconCache();

        Serial.println("[INIT] Setting up apps...");
        setupApps();

        // Load demo weather data for development (6 days to test 2-page pagination)
        Serial.println("[INIT] Loading demo weather data (6 days)...");
        strncpy(weatherData.currentIcon, "w_clear_day", sizeof(weatherData.currentIcon));
        weatherData.currentTemp = 18;
        weatherData.currentTempMin = 12;
        weatherData.currentTempMax = 24;
        weatherData.currentHumidity = 65;
        strncpy(weatherData.forecast[0].icon, "w_partly_day", sizeof(weatherData.forecast[0].icon));
        weatherData.forecast[0].tempMin = 12;
        weatherData.forecast[0].tempMax = 22;
        strncpy(weatherData.forecast[0].dayName, "LUN", sizeof(weatherData.forecast[0].dayName));
        strncpy(weatherData.forecast[1].icon, "w_rain", sizeof(weatherData.forecast[1].icon));
        weatherData.forecast[1].tempMin = 8;
        weatherData.forecast[1].tempMax = 15;
        strncpy(weatherData.forecast[1].dayName, "MAR", sizeof(weatherData.forecast[1].dayName));
        strncpy(weatherData.forecast[2].icon, "w_snow", sizeof(weatherData.forecast[2].icon));
        weatherData.forecast[2].tempMin = 0;
        weatherData.forecast[2].tempMax = 6;
        strncpy(weatherData.forecast[2].dayName, "MER", sizeof(weatherData.forecast[2].dayName));
        strncpy(weatherData.forecast[3].icon, "w_clear_day", sizeof(weatherData.forecast[3].icon));
        weatherData.forecast[3].tempMin = 14;
        weatherData.forecast[3].tempMax = 26;
        strncpy(weatherData.forecast[3].dayName, "JEU", sizeof(weatherData.forecast[3].dayName));
        strncpy(weatherData.forecast[4].icon, "w_cloudy", sizeof(weatherData.forecast[4].icon));
        weatherData.forecast[4].tempMin = 10;
        weatherData.forecast[4].tempMax = 19;
        strncpy(weatherData.forecast[4].dayName, "VEN", sizeof(weatherData.forecast[4].dayName));
        strncpy(weatherData.forecast[5].icon, "w_partly_day", sizeof(weatherData.forecast[5].icon));
        weatherData.forecast[5].tempMin = 15;
        weatherData.forecast[5].tempMax = 28;
        strncpy(weatherData.forecast[5].dayName, "SAM", sizeof(weatherData.forecast[5].dayName));
        weatherData.forecastCount = 6;
        weatherData.lastUpdate = millis();
        weatherData.valid = true;
    }

    logMemory();
    Serial.println("[INIT] Setup complete!");
    Serial.println();
}

// ============================================================================
// Main Loop
// ============================================================================

void loop() {
    // Handle pending reboot (allow response to be sent first)
    if (pendingReboot && (millis() - rebootRequestTime > 500)) {
        Serial.println("[SYSTEM] Rebooting...");
        ESP.restart();
    }

    ArduinoOTA.handle();
    loopWiFi();
    loopMQTT();
    loopSleepTransition();
    loopApps();
    loopDisplay();

