nicolas-codemate/esp32-pixelcast/src/main.cpp
void weatherParseTodayBlock(JsonObjectConst todayBlock)
{
    weatherData.today.hourCount = 0;
    weatherData.today.segmentCount = 0;

    if (todayBlock.isNull())
    {
        return;
    }

    if (todayBlock["hours"].is<JsonArrayConst>())
    {
        JsonArrayConst hoursArray = todayBlock["hours"];
        int hourCount = min((int)hoursArray.size(), (int)MAX_TODAY_HOURS);
        for (int i = 0; i < hourCount; i++)
        {
            JsonObjectConst hourObject = hoursArray[i];
            TodayHour* hourSlot = &weatherData.today.hours[i];
            hourSlot->hour = constrain((int)(hourObject["h"] | 0), 0, 23);
            // No reading on Earth comes near +/-100 C, and a wider span would
            // overflow the int16_t arithmetic behind the curve
            hourSlot->temp = constrain((int)(hourObject["temp"] | 0), -100, 100);
            hourSlot->precipProbability = constrain((int)(hourObject["pop"] | 0), 0, 100);
            hourSlot->precipTenthsOfMm = constrain((int)(hourObject["precip"] | 0), 0, 255);
        }
        weatherData.today.hourCount = hourCount;
    }

    if (todayBlock["segments"].is<JsonArrayConst>())
    {
        JsonArrayConst segmentsArray = todayBlock["segments"];
        int segmentCount = min((int)segmentsArray.size(), (int)MAX_TODAY_SEGMENTS);
        for (int i = 0; i < segmentCount; i++)
        {
            JsonObjectConst segmentObject = segmentsArray[i];
            TodaySegment* segmentSlot = &weatherData.today.segments[i];
            segmentSlot->fromHour = constrain((int)(segmentObject["from"] | 0), 0, 23);
            segmentSlot->toHour = constrain((int)(segmentObject["to"] | 0), 0, 23);
            strlcpy(segmentSlot->icon, segmentObject["icon"] | "", sizeof(segmentSlot->icon));
        }
        weatherData.today.segmentCount = segmentCount;
    }
}

// ============================================================================
// Tracker Functions
// ============================================================================

TrackerData* trackerFind(const char* name) {
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (trackers[i].valid && strcmp(trackers[i].name, name) == 0) {
            return &trackers[i];
        }
    }
    return nullptr;
}

TrackerData* trackerAllocate(const char* name) {
    // Check if already exists
    TrackerData* existing = trackerFind(name);
    if (existing) return existing;

    // Find first free slot
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (!trackers[i].valid) {
            memset(&trackers[i], 0, sizeof(TrackerData));
            strlcpy(trackers[i].name, name, sizeof(trackers[i].name));
            trackers[i].symbolColor = 0xFFFFFF;    // Default white
            trackers[i].sparklineColor = 0x00D4FF;  // Default cyan
            strlcpy(trackers[i].sparklinePeriod, "24h", sizeof(trackers[i].sparklinePeriod));
            trackers[i].valid = true;
            trackerCount++;
            return &trackers[i];
        }
    }
    return nullptr;
}

bool trackerRemove(const char* name) {
    TrackerData* tracker = trackerFind(name);
    if (!tracker) return false;

    tracker->valid = false;
    trackerCount--;

    // Remove corresponding app from rotation
    char appId[32];
    snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name);
    appRemove(appId);

    Serial.printf("[TRACKER] Removed: %s\n", name);
    return true;
}

void trackerInit() {
    memset(trackers, 0, sizeof(trackers));
    trackerCount = 0;
    Serial.println("[TRACKER] Initialized");
}

// ============================================================================
// Notification Queue Management
// ============================================================================

void notifInit() {
    memset(notifications, 0, sizeof(notifications));
    notificationCount = 0;
    currentNotifIndex = -1;
    savedAppIndex = -1;
    memset(&notifScrollState, 0, sizeof(notifScrollState));
    Serial.println("[NOTIF] Initialized");
}

int8_t notifAdd(const char* id, const char* text, const char* icon,
                uint32_t textColor, uint32_t bgColor, uint16_t duration,
                bool hold, bool urgent, bool stack) {
    // Replace mode: clear all existing notifications first
    if (!stack) {
        notifClearAll();
    }

    // Find a free slot
    int8_t freeSlot = -1;
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (!notifications[i].active) {
            freeSlot = i;
            break;
        }
    }

    if (freeSlot < 0) {
        Serial.println("[NOTIF] Queue full, dropping notification");
        return -1;
    }

    NotificationItem* notif = &notifications[freeSlot];
    memset(notif, 0, sizeof(NotificationItem));

    // Generate ID if not provided
    if (id && strlen(id) > 0) {
        strlcpy(notif->id, id, sizeof(notif->id));
    } else {
        snprintf(notif->id, sizeof(notif->id), "notif_%lu", millis());
    }

    strlcpy(notif->text, text, sizeof(notif->text));
    if (icon) {
        strlcpy(notif->icon, icon, sizeof(notif->icon));
    }

    notif->textColor = textColor;
    notif->backgroundColor = bgColor;
    notif->duration = duration;
    notif->hold = hold;
    notif->urgent = urgent;
    notif->stack = stack;
    notif->active = true;
    notif->displayedAt = 0;  // Not yet shown

    notificationCount++;

    // If urgent, force it to be picked up next
    if (urgent) {
        currentNotifIndex = freeSlot;
    }

    Serial.printf("[NOTIF] Added: %s (duration=%d, hold=%d, urgent=%d, stack=%d)\n",
                  notif->id, duration, hold, urgent, stack);
    return freeSlot;
}

bool notifDismiss() {
    if (currentNotifIndex < 0 || !notifications[currentNotifIndex].active) {
        return false;
    }

    Serial.printf("[NOTIF] Dismissed: %s\n", notifications[currentNotifIndex].id);
    notifications[currentNotifIndex].active = false;
    notificationCount--;
    currentNotifIndex = -1;
    return true;
}

void notifClearAll() {
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        notifications[i].active = false;
    }
    notificationCount = 0;
    currentNotifIndex = -1;
    Serial.println("[NOTIF] Cleared all");
}

NotificationItem* notifGetCurrent() {
    if (currentNotifIndex >= 0 && notifications[currentNotifIndex].active) {
        return &notifications[currentNotifIndex];
    }
    return nullptr;
}

NotificationItem* notifGetNext() {
    if (notificationCount == 0) return nullptr;

    // First pass: find urgent notifications not yet displayed
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (notifications[i].active && notifications[i].urgent && notifications[i].displayedAt == 0) {
            currentNotifIndex = i;
            return &notifications[i];
        }
    }

