nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Second pass: find any active notification not yet displayed
    for (uint8_t i = 0; i < MAX_NOTIFICATIONS; i++) {
        if (notifications[i].active && notifications[i].displayedAt == 0) {
            currentNotifIndex = i;
            return &notifications[i];
        }
    }

    return nullptr;
}

bool notifIsExpired(NotificationItem* notif) {
    if (!notif || !notif->active) return true;
    if (notif->hold || notif->duration == 0) return false;
    if (notif->displayedAt == 0) return false;  // Not yet shown
    return (millis() - notif->displayedAt) > notif->duration;
}

// Parse color from JSON (hex string "#FF8800", RGB array [255,136,0], or raw uint32)
uint32_t parseColorValue(JsonVariant colorVar, uint32_t defaultColor) {
    if (colorVar.isNull()) return defaultColor;

    if (colorVar.is<JsonArray>()) {
        JsonArray arr = colorVar.as<JsonArray>();
        if (arr.size() == 3) {
            return ((uint32_t)arr[0].as<uint8_t>() << 16) |
                   ((uint32_t)arr[1].as<uint8_t>() << 8) |
                   (uint32_t)arr[2].as<uint8_t>();
        }
    } else if (colorVar.is<const char*>()) {
        const char* str = colorVar.as<const char*>();
        if (str[0] == '#') str++;
        return strtoul(str, NULL, 16);
    } else {
        return colorVar.as<uint32_t>();
    }
    return defaultColor;
}

// Format a uint32 color (0xRRGGBB) as hex string "#RRGGBB" into a buffer
void formatColorHex(uint32_t color, char* buffer, size_t bufSize) {
    snprintf(buffer, bufSize, "#%02X%02X%02X",
             (uint8_t)((color >> 16) & 0xFF),
             (uint8_t)((color >> 8) & 0xFF),
             (uint8_t)(color & 0xFF));
}

// Parse polymorphic text field: string, {text,color} object, or [{t,c},...] array
void parseTextFieldWithSegments(JsonVariant field, char* textBuffer, size_t textBufferSize,
                                TextSegment* segments, uint8_t* segmentCount, uint32_t defaultColor) {
    *segmentCount = 0;
    textBuffer[0] = '\0';

    if (field.isNull()) return;

    // Simple string: "text"
    if (field.is<const char*>()) {
        strlcpy(textBuffer, field.as<const char*>(), textBufferSize);
        return;
    }

    // Object with text and color: {"text": "hello", "color": "#FF0000"}
    if (field.is<JsonObject>()) {
        JsonObject obj = field.as<JsonObject>();
        strlcpy(textBuffer, obj["text"] | "", textBufferSize);
        if (!obj["color"].isNull()) {
            segments[0].offset = 0;
            segments[0].color = parseColorValue(obj["color"], defaultColor);
            *segmentCount = 1;
        }
        return;
    }

    // Array of segments: [{"t": "22.5", "c": "#FF8800"}, {"t": "C", "c": "#666666"}]
    if (field.is<JsonArray>()) {
        JsonArray arr = field.as<JsonArray>();
        size_t pos = 0;
        uint8_t count = 0;
        for (JsonObject seg : arr) {
            if (count >= MAX_TEXT_SEGMENTS) break;
            const char* t = seg["t"] | "";
            size_t tLen = strlen(t);
            if (pos + tLen >= textBufferSize) break;

            // Record segment offset and color
            segments[count].offset = (uint8_t)pos;
            segments[count].color = parseColorValue(seg["c"], defaultColor);
            count++;

            // Concatenate text
            memcpy(textBuffer + pos, t, tLen);
            pos += tLen;
        }
        textBuffer[pos] = '\0';
        *segmentCount = count;
        return;
    }
}

// Serialize text field in polymorphic format for JSON output
void serializeTextField(JsonObject& obj, const char* fieldName, const char* text,
                        const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        obj[fieldName] = text;
        return;
    }

    // Build array of {t, c} segments
    JsonArray arr = obj[fieldName].to<JsonArray>();
    size_t textLen = strlen(text);
    for (uint8_t i = 0; i < segmentCount; i++) {
        JsonObject seg = arr.add<JsonObject>();
        // Extract substring from offset to next segment (or end)
        size_t start = segments[i].offset;
        size_t end = (i + 1 < segmentCount) ? segments[i + 1].offset : textLen;
        if (start >= textLen) break;
        if (end > textLen) end = textLen;

        // Copy substring
        char buf[64];
        size_t len = end - start;
        if (len >= sizeof(buf)) len = sizeof(buf) - 1;
        memcpy(buf, text + start, len);
        buf[len] = '\0';
        seg["t"] = (const char*)buf;

        char colorHex[8];
        formatColorHex(segments[i].color, colorHex, sizeof(colorHex));
        seg["c"] = (const char*)colorHex;
    }
}

// Draw sparkline chart from scaled uint16 data
void drawSparkline(const uint16_t* data, uint8_t count, int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
    if (count < 2) return;

    // Find data min/max for vertical scaling
    uint16_t dataMin = 65535;
    uint16_t dataMax = 0;
    for (uint8_t i = 0; i < count; i++) {
        if (data[i] < dataMin) dataMin = data[i];
        if (data[i] > dataMax) dataMax = data[i];
    }

    uint16_t dataRange = dataMax - dataMin;
    if (dataRange == 0) dataRange = 1;

    // Plot line segments between consecutive points
    for (uint8_t i = 0; i < count - 1; i++) {
        int16_t x0 = x + (int32_t)i * (w - 1) / (count - 1);
        int16_t x1 = x + (int32_t)(i + 1) * (w - 1) / (count - 1);
        // Invert Y: high value = top of chart
        int16_t y0 = y + h - 1 - (int32_t)(data[i] - dataMin) * (h - 1) / dataRange;
        int16_t y1 = y + h - 1 - (int32_t)(data[i + 1] - dataMin) * (h - 1) / dataRange;
        dma_display->drawLine(x0, y0, x1, y1, color);
    }
}

// Draw a small up/down arrow (5x5 pixels)
void drawTrackerArrow(int16_t x, int16_t y, bool up, uint16_t color) {
    if (up) {
        //   ..X..
        //   .XXX.
        //   XXXXX
        //   ..X..
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 1, y + 1, color);
        dma_display->drawPixel(x + 2, y + 1, color);
        dma_display->drawPixel(x + 3, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    } else {
        //   ..X..
        //   ..X..
        //   XXXXX
        //   .XXX.
        //   ..X..
        dma_display->drawPixel(x + 2, y,     color);
        dma_display->drawPixel(x + 2, y + 1, color);
        for (int16_t i = 0; i < 5; i++) dma_display->drawPixel(x + i, y + 2, color);
        dma_display->drawPixel(x + 1, y + 3, color);
        dma_display->drawPixel(x + 2, y + 3, color);
        dma_display->drawPixel(x + 3, y + 3, color);
        dma_display->drawPixel(x + 2, y + 4, color);
    }
}

