nicolas-codemate/esp32-pixelcast/src/main.cpp
// Smart value formatting with thousand separators
void formatTrackerValue(float value, char* buffer, size_t bufSize) {
    if (value >= 1000.0f) {
        // Integer with thousand separator
        uint32_t intVal = (uint32_t)value;
        // Build string with commas from right to left
        char tmp[20];
        int len = snprintf(tmp, sizeof(tmp), "%lu", (unsigned long)intVal);
        int commas = (len - 1) / 3;
        int outLen = len + commas;
        if ((size_t)outLen >= bufSize) {
            snprintf(buffer, bufSize, "%lu", (unsigned long)intVal);
            return;
        }
        buffer[outLen] = '\0';
        int srcIdx = len - 1;
        int dstIdx = outLen - 1;
        int digitCount = 0;
        while (srcIdx >= 0) {
            buffer[dstIdx--] = tmp[srcIdx--];
            digitCount++;
            if (digitCount % 3 == 0 && srcIdx >= 0) {
                buffer[dstIdx--] = ',';
            }
        }
    } else if (value >= 1.0f) {
        snprintf(buffer, bufSize, "%.2f", value);
    } else {
        snprintf(buffer, bufSize, "%.5f", value);
    }
}

// Tracker header and footer geometry, shared by the full redraw and the scroll repaints.
#define TRACKER_HEADER_HEIGHT       12
#define TRACKER_SYMBOL_X            13
#define TRACKER_SYMBOL_X_NO_ICON    2
#define TRACKER_SYMBOL_Y            4
#define TRACKER_STALE_BADGE_X       42
#define TRACKER_BOTTOM_Y            56
#define TRACKER_BOTTOM_COLOR        0x969696
#define TRACKER_BOTTOM_COLOR_STALE  0x3C3C3C

// --- Row 1, the symbol alone (y=0..11) ---
// Runs every scroll step, and the DMA reads this framebuffer while it is being written, so it
// touches nothing outside the strip the name moves in: clearing the icon to paint it back
// identically twenty times a second is seen as flicker.
void displayDrawTrackerSymbol(TrackerData* tracker, bool isStale) {
    uint16_t black = dma_display->color565(0, 0, 0);

    // Taken from the last full redraw rather than the cache, so an icon evicted mid-scroll
    // cannot shift the name sideways
    int16_t symbolAreaX = trackerIconDrawn ? TRACKER_SYMBOL_X : TRACKER_SYMBOL_X_NO_ICON;
    int16_t symbolAreaEnd = isStale ? TRACKER_STALE_BADGE_X - 1 : DISPLAY_WIDTH;

    dma_display->fillRect(symbolAreaX, 0, symbolAreaEnd - symbolAreaX, TRACKER_HEADER_HEIGHT, black);

    // drawIndicators skips a blinking indicator in its off phase instead of erasing it, so the
    // corners it owns are cleared here for it to blink at all - and only while it is in use,
    // since the top-left one sits over the icon
    for (uint8_t corner = 0; corner < 2; corner++) {
        if (indicators[corner].mode == INDICATOR_OFF) continue;
        int16_t cornerX = (corner == 0) ? 0 : DISPLAY_WIDTH - INDICATOR_FOOTPRINT;
        dma_display->fillRect(cornerX, 0, INDICATOR_FOOTPRINT, INDICATOR_FOOTPRINT, black);

        if (corner == 0 && trackerIconDrawn) {
            // Cache-only lookup: getIcon would fall back to a filesystem read, 20 times a second
            drawIconAtScale(getCachedIcon(tracker->icon), 2, 2, 1);
        }
    }

    scrollStateArm(trackerSymbolScrollState, calculateTextWidth(tracker->symbol),
                   symbolAreaEnd - symbolAreaX);

    int16_t symbolX = symbolAreaX;
    if (trackerSymbolScrollState.needsScroll) {
        symbolX -= trackerSymbolScrollState.scrollOffset;
    }

    uint32_t symbolColor = isStale ? dimColorQuarter(tracker->symbolColor) : tracker->symbolColor;

    dma_display->setFont(NULL);  // Default 5x7 font
    dma_display->setTextSize(1);
    printTextWithinBounds(tracker->symbol, symbolX, TRACKER_SYMBOL_Y,
                          symbolAreaX, symbolAreaEnd, symbolColor);
}

// --- Row 1: icon + symbol (y=0..11) ---
// The band starts at y=0 so a blinking indicator that went dark does not stay lit.
void displayDrawTrackerHeader(TrackerData* tracker, bool isStale, CachedIcon* icon) {
    dma_display->fillRect(0, 0, DISPLAY_WIDTH, TRACKER_HEADER_HEIGHT, dma_display->color565(0, 0, 0));

    trackerIconDrawn = (icon && icon->valid);
    if (trackerIconDrawn) {
        drawIconAtScale(icon, 2, 2, 1);
    }

    if (isStale) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dma_display->color565(200, 0, 0));
        dma_display->setCursor(TRACKER_STALE_BADGE_X, 6);
        dma_display->print("STALE");
    }

    displayDrawTrackerSymbol(tracker, isStale);

    // Contract for the rows drawn after this one: default font, size 1
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);
}

// --- Bottom text (y=56..63) ---
void displayDrawTrackerBottom(TrackerData* tracker, bool isStale) {
    dma_display->fillRect(0, TRACKER_BOTTOM_Y, DISPLAY_WIDTH,
                          DISPLAY_HEIGHT - TRACKER_BOTTOM_Y, dma_display->color565(0, 0, 0));

    if (strlen(tracker->bottomText) == 0) {
        return;
    }

    int16_t textWidth = calculateTomThumbTextWidth(tracker->bottomText);
    scrollStateArm(trackerBottomScrollState, textWidth, DISPLAY_WIDTH - 4);

    int16_t textX;
    if (trackerBottomScrollState.needsScroll) {
        textX = 2 - trackerBottomScrollState.scrollOffset;
    } else {
        textX = (DISPLAY_WIDTH - textWidth) / 2;
    }

    // A stale screen dims every colour it shows, segments included
    TextSegment dimmedSegments[MAX_TEXT_SEGMENTS];
    const TextSegment* segments = tracker->bottomTextSegments;
    if (isStale && tracker->bottomTextSegmentCount > 0) {
        for (uint8_t i = 0; i < tracker->bottomTextSegmentCount; i++) {
            dimmedSegments[i] = tracker->bottomTextSegments[i];
            dimmedSegments[i].color = dimColorQuarter(dimmedSegments[i].color);
        }
        segments = dimmedSegments;
    }

    // dimDefault would apply a 3/4 factor that no input colour turns back into the grey this
    // row has always used, so the grey is passed in directly
    printLabelWithSegments(tracker->bottomText, textX, 62,
                           isStale ? TRACKER_BOTTOM_COLOR_STALE : TRACKER_BOTTOM_COLOR,
                           segments, tracker->bottomTextSegmentCount, false);
}

// Display tracker layout on 64x64 matrix
void displayShowTracker(TrackerData* tracker) {
    if (!tracker) return;

    unsigned long trackerAge = millis() - tracker->lastUpdate;
    bool isStale = (trackerAge > TRACKER_STALE_TIMEOUT);

    // A tracker screen shows a fixed snapshot, so it only has to be painted when the data
    // arrives or when it goes stale. Repainting it every second would blank the framebuffer
    // the DMA is reading, which shows up as flicker on single-buffered builds. A scrolling
    // symbol or footer does need a frame every 50 ms, so those two rows - and only those -
    // are repainted on their own.
    bool needsFullRedraw = (trackerLastUpdateDrawn != tracker->lastUpdate) ||
                           (trackerStaleDrawn != isStale);

    if (!needsFullRedraw) {
        if (trackerSymbolScrollState.needsScroll) {
            displayDrawTrackerSymbol(tracker, isStale);
        }
        if (trackerBottomScrollState.needsScroll) {
            displayDrawTrackerBottom(tracker, isStale);
        }
        drawIndicators();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        return;
    }

