nicolas-codemate/esp32-pixelcast/src/main.cpp
    trackerLastUpdateDrawn = tracker->lastUpdate;
    trackerStaleDrawn = isStale;

    dma_display->clearScreen();

    // Color helpers
    uint16_t white = dma_display->color565(255, 255, 255);
    uint16_t dimWhite = isStale ? dma_display->color565(60, 60, 60) : dma_display->color565(150, 150, 150);
    uint16_t dimGray = dma_display->color565(40, 40, 40);
    uint16_t green = isStale ? dma_display->color565(0, 60, 0) : dma_display->color565(0, 200, 0);
    uint16_t red = isStale ? dma_display->color565(60, 0, 0) : dma_display->color565(200, 0, 0);

    uint8_t spkR = (tracker->sparklineColor >> 16) & 0xFF;
    uint8_t spkG = (tracker->sparklineColor >> 8) & 0xFF;
    uint8_t spkB = tracker->sparklineColor & 0xFF;
    uint16_t sparklineColor565 = isStale
        ? dma_display->color565(spkR / 4, spkG / 4, spkB / 4)
        : dma_display->color565(spkR, spkG, spkB);

    uint16_t valueColor = isStale ? dma_display->color565(60, 60, 60) : white;

    displayDrawTrackerHeader(tracker, isStale, getIcon(tracker->icon));

    // --- Row 2: Price value (y=14..22) ---
    char valueBuf[20];
    formatTrackerValue(tracker->currentValue, valueBuf, sizeof(valueBuf));
    dma_display->setTextColor(valueColor);
    dma_display->setCursor(2, 16);
    dma_display->print(valueBuf);

    // Currency symbol right-aligned in TomThumb
    if (strlen(tracker->currencySymbol) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t currWidth = strlen(tracker->currencySymbol) * 4;
        dma_display->setCursor(62 - currWidth, 22);
        dma_display->print(tracker->currencySymbol);
        dma_display->setFont(NULL);  // Reset to default
    }

    // --- Row 3: Arrow + Change % (y=25..33) ---
    bool isPositive = (tracker->changePercent >= 0.0f);
    uint16_t changeColor = isPositive ? green : red;

    drawTrackerArrow(2, 27, isPositive, changeColor);

    char changeBuf[16];
    snprintf(changeBuf, sizeof(changeBuf), "%s%.2f%%",
             isPositive ? "+" : "", tracker->changePercent);
    dma_display->setTextColor(changeColor);
    dma_display->setCursor(9, 27);
    dma_display->print(changeBuf);

    // --- Separator line (y=37) ---
    drawSeparatorLine(37, dimGray);

    // --- Sparkline period label right-aligned (y=39) ---
    if (strlen(tracker->sparklinePeriod) > 0) {
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(dimWhite);
        int16_t periodWidth = strlen(tracker->sparklinePeriod) * 4;
        dma_display->setCursor(62 - periodWidth, 43);
        dma_display->print(tracker->sparklinePeriod);
        dma_display->setFont(NULL);
    }

    // --- Sparkline chart (y=40..53, x=2..61) ---
    if (tracker->sparklineCount >= 2) {
        drawSparkline(tracker->sparkline, tracker->sparklineCount,
                      2, 40, 60, 14, sparklineColor565);
    }

    // --- Separator line (y=55) ---
    drawSeparatorLine(55, dimGray);

    displayDrawTrackerBottom(tracker, isStale);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

#define TODAY_HEAVY_PRECIP_TENTHS 10
#define TODAY_MIN_PRECIP_PROBABILITY 15

// Hourly chart geometry, all of it inside the y=32-63 block of weatherclock.
// x=61-62 belong to the page indicator, so nothing here goes past x=59.
#define TODAY_HOUR_PITCH_X      5
#define TODAY_BAR_WIDTH         4
#define TODAY_BAR_MAX_HEIGHT    13
#define TODAY_CHART_LEFT_X      1
#define TODAY_CHART_RIGHT_X     59
// Centring the first bar on the margin plus half a bar is what keeps the whole
// chart, bars included, inside TODAY_CHART_LEFT_X without clamping anything
#define TODAY_FIRST_COLUMN_X    (TODAY_CHART_LEFT_X + TODAY_BAR_WIDTH / 2)
#define TODAY_SUMMARY_ROW_TOP_Y 33
#define TODAY_CURVE_TOP_Y       40
#define TODAY_CURVE_BOTTOM_Y    54
#define TODAY_AREA_FLOOR_Y      55
#define TODAY_BASELINE_Y        56
#define TODAY_HOUR_LABEL_TOP_Y  58
#define TODAY_HOUR_LABEL_STEP   4    // one hour label and one tick every four hours

// TomThumb carries neither a degree sign, nor an hour mark short enough to read
// as a unit, nor an mm ligature narrow enough to fit, so the three are painted
// pixel by pixel. Each row below is a bitmask drawn left to right from x, and
// topY is the top of the glyph box: a leading empty row means the glyph hangs
// lower than the digits it follows.
#define DEGREE_GLYPH_WIDTH 3
#define HOUR_UNIT_GLYPH_WIDTH 3
#define MILLIMETRE_GLYPH_WIDTH 7

void drawGlyphRows(int16_t x, int16_t topY, uint8_t width,
                   const uint8_t* rowBits, uint8_t rowCount, uint16_t color)
{
    for (uint8_t row = 0; row < rowCount; row++)
    {
        for (uint8_t column = 0; column < width; column++)
        {
            if (rowBits[row] & (1 << (width - 1 - column)))
            {
                dma_display->drawPixel(x + column, topY + row, color);
            }
        }
    }
}

void drawDegreeGlyph(int16_t x, int16_t topY, uint16_t color)
{
    static const uint8_t degreeRows[] = {
        0b010,
        0b101,
        0b010
    };
    drawGlyphRows(x, topY, DEGREE_GLYPH_WIDTH, degreeRows, sizeof(degreeRows), color);
}

void drawHourUnitGlyph(int16_t x, int16_t topY, uint16_t color)
{
    static const uint8_t hourUnitRows[] = {
        0b000,
        0b100,
        0b100,
        0b111,
        0b101
    };
    drawGlyphRows(x, topY, HOUR_UNIT_GLYPH_WIDTH, hourUnitRows, sizeof(hourUnitRows), color);
}

void drawMillimetreGlyph(int16_t x, int16_t topY, uint16_t color)
{
    static const uint8_t millimetreRows[] = {
        0b0000000,
        0b0000000,
        0b1111111,
        0b1010101,
        0b1010101
    };
    drawGlyphRows(x, topY, MILLIMETRE_GLYPH_WIDTH, millimetreRows, sizeof(millimetreRows), color);
}

// The ramp is anchored on absolute Celsius, not on the extremes of the window:
// anchored on the window, a -6 degree hour would take the warm end of the ramp
// simply for being the mildest hour of a freezing day. Outside these two bounds
// the ramp saturates.
#define TODAY_RAMP_COLD_CELSIUS (-10)
#define TODAY_RAMP_WARM_CELSIUS 35

// Tenths of a degree: the ramp is sampled once per pixel column, and whole degrees
// would break the gradient into five-pixel steps between two hours.
uint8_t weatherTemperatureWarmth(int16_t temperatureTenths)
{
    const int16_t coldTenths = TODAY_RAMP_COLD_CELSIUS * 10;
    const int16_t warmTenths = TODAY_RAMP_WARM_CELSIUS * 10;
    int16_t clampedTenths = constrain(temperatureTenths, coldTenths, warmTenths);
    return (uint8_t)((int32_t)(clampedTenths - coldTenths) * 255 / (warmTenths - coldTenths));
}

// The panel bleeds on saturated red, so the warm end stops at orange. Every stop
// keeps its red channel above 110, which is what separates the ramp from the rain
// bars: those are pure blues with no red at all.
uint16_t weatherTemperatureRampColor(uint8_t warmth)
{
    // { ramp position, red, green, blue }, one stop per named temperature:
    // -10 violet, 0 periwinkle, 10 teal, 18 yellow green, 26 gold, 35 orange
    static const uint8_t rampStops[][4] = {
        {   0, 140,  70, 240 },
        {  57, 130, 130, 245 },
        { 113, 120, 205, 200 },
        { 159, 160, 225, 110 },
        { 204, 235, 205,  80 },
        { 255, 255, 140,  20 }
    };
    const uint8_t rampStopCount = sizeof(rampStops) / sizeof(rampStops[0]);

    uint8_t upperStop = rampStopCount - 1;
    for (uint8_t stop = 1; stop < rampStopCount; stop++)
    {
        if (warmth <= rampStops[stop][0])
        {
            upperStop = stop;
            break;
        }
    }
    uint8_t lowerStop = upperStop - 1;

    int16_t stopDistance = (int16_t)rampStops[upperStop][0] - (int16_t)rampStops[lowerStop][0];
    int16_t positionInStop = (int16_t)warmth - (int16_t)rampStops[lowerStop][0];

