nicolas-codemate/esp32-pixelcast/src/main.cpp
                // Max temp in red (TomThumb baseline=63, glyphs y=58-62)
                drawCenteredTemperature(colCenter, 63,
                                        weatherData.forecast[forecastIndex].tempMax, warmRed);
            }
        }

        // Page indicator squares (vertical, right edge, just below second separator)
        if (forecastPageCount > 1) {
            uint16_t activeDot = dma_display->color565(120, 60, 200);  // Dark violet
            int squareSize = 2;
            int gap = 1;
            int step = squareSize + gap;  // 3px per indicator
            int dotX = 61;               // 2px margin from right edge (x=63)
            int dotStartY = 33;          // Just below separator at y=31
            for (int d = 0; d < forecastPageCount; d++) {
                uint16_t dotColor = (d == currentPage) ? activeDot : dimGray;
                dma_display->fillRect(dotX, dotStartY + d * step, squareSize, squareSize, dotColor);
            }
        }
    }

    // ---- Clock (y=13-20) - redrawn every second ----
    // Clear only the clock region (y=11 to y=20) to avoid full-screen flicker
    dma_display->fillRect(0, 11, DISPLAY_WIDTH, 10, black);

    dma_display->setTextColor(mintGreen);

    // HH:MM in NULL font (5 chars * 6px = 30px)
    char hmStr[6];
    snprintf(hmStr, sizeof(hmStr), "%02d:%02d", hours, minutes);
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);

    int16_t hmX = (DISPLAY_WIDTH - 30) / 2 - 6;  // Shift left for seconds
    dma_display->setCursor(hmX, 13);
    dma_display->print(hmStr);

    // Seconds in TomThumb (baseline=20, bottom-aligned with NULL font y=13+6=19)
    dma_display->setFont(&TomThumb);
    char secStr[4];
    snprintf(secStr, sizeof(secStr), ":%02d", seconds);
    dma_display->setCursor(hmX + 31, 20);
    dma_display->print(secStr);

    // Reset font
    dma_display->setFont(NULL);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowApp(AppItem* app) {
    if (!app) return;

    // Detect app switch and clear screen to prevent ghosting
    int8_t appIndex = appFind(app->id);
    if (appIndex != lastDisplayedAppIndex) {
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
            dma_display->clearScreen();
        #endif
        lastDisplayedAppIndex = appIndex;
        // Reset weather display cache to force full redraw
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        // Reset tracker display cache to force full redraw
        trackerLastUpdateDrawn = 0;
        resetTrackerScrollStates();
        // Reset forecast pagination to first page
        forecastPage = 0;
        lastForecastPageSwitch = millis();
    }

    // Handle system apps
    if (strcmp(app->id, "clock") == 0) {
        displayShowTime();
        return;
    }

    if (strcmp(app->id, "date") == 0) {
        displayShowDate();
        return;
    }

    if (strcmp(app->id, "weatherclock") == 0) {
        displayShowWeatherClock(app->duration);
        return;
    }

    // Tracker layout apps (ID starts with "tracker_")
    if (strncmp(app->id, TRACKER_ID_PREFIX, strlen(TRACKER_ID_PREFIX)) == 0) {
        const char* trackerName = app->id + strlen(TRACKER_ID_PREFIX);
        TrackerData* tracker = trackerFind(trackerName);
        if (tracker && tracker->valid) {
            // The same app can have rendered as a custom one moments ago, when apps.json was
            // reloaded before the tracker data arrived. That fallback arms appScrollState with
            // the symbol it printed as plain text, and nothing else disarms it: without this
            // the loop would keep asking for 20 redraws a second for a string no longer drawn.
            if (appScrollState.needsScroll) {
                resetScrollState();
            }
            displayShowTracker(tracker);
            return;
        }
        // Fallback to default custom app layout if no data
    }

    // Multi-zone layout apps
    if (app->zoneCount >= 2) {
        displayShowMultiZone(app);
        return;
    }

    // Custom apps (single-zone)
    dma_display->clearScreen();

    // Layout calculation - VERTICAL layout for 64x64 panel
    // +----------64px-----------+
    // |      Icon (8-16px)      |  <- centered, top
    // |                         |
    // |         Text            |  <- centered, below icon
    // |      (scrollable)       |
    // +-------------------------+

    int16_t textAreaX = 2;
    int16_t textAreaWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
    int16_t textYPos = 28;  // Default Y position for text

    // Try to load icon if specified
    CachedIcon* icon = nullptr;
    if (strlen(app->icon) > 0) {
        icon = getIcon(app->icon);
    }

    // Adjust layout if icon is present - VERTICAL layout
    if (icon && icon->valid) {
        // Calculate displayed size (upscale x2 for 8x8 icons)
        uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
        uint8_t displayWidth = icon->width * scale;
        uint8_t displayHeight = icon->height * scale;

        // Draw icon centered horizontally at top
        int16_t iconX = (DISPLAY_WIDTH - displayWidth) / 2;
        int16_t iconY = 2;  // 2px from top
        drawIcon(icon, iconX, iconY);

        // Text starts below icon with gap
        textYPos = iconY + displayHeight + 6;  // 6px gap below icon
    }

    dma_display->setTextSize(1);

    // Calculate text width and check if scrolling needed
    scrollStateArm(appScrollState, calculateTextWidth(app->text), textAreaWidth);

    // Calculate x position with scroll offset
    int16_t xPos = textAreaX;
    if (appScrollState.needsScroll) {
        xPos = textAreaX - appScrollState.scrollOffset;
    }

    // Draw text with segment-aware coloring
    printTextWithSegments(app->text, xPos, textYPos, app->textColor,
                          app->textSegments, app->textSegmentCount);

    // Draw label below text if present (TomThumb font, dimmed color)
    if (app->label[0] != '\0') {
        int16_t labelWidth = strlen(app->label) * 4;
        int16_t labelX = (DISPLAY_WIDTH - labelWidth) / 2;
        if (labelX < 2) labelX = 2;
        int16_t labelY = textYPos + 12;
        printLabelWithSegments(app->label, labelX, labelY, app->textColor,
                               app->labelSegments, app->labelSegmentCount, true);
    }

