nicolas-codemate/esp32-pixelcast/src/main.cpp
            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 64, 31);
            break;
        }
        case 3: {
            // Top row full-width (zone0, 64x31), bottom row split (zone1 + zone2, 31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator in bottom half at x=31
            dma_display->drawFastVLine(31, 33, 31, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 31, 31);
            displayShowZone(allZones[2], 33, 33, 31, 31);
            break;
        }
        case 4: {
            // Four quadrants (31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator at x=31
            dma_display->drawFastVLine(31, 0, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 31, 31);
            displayShowZone(allZones[1], 33, 0, 31, 31);
            displayShowZone(allZones[2], 0, 33, 31, 31);
            displayShowZone(allZones[3], 33, 33, 31, 31);
            break;
        }
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayClear() {
    dma_display->clearScreen();
    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displaySetBrightness(uint8_t brightness) {
    currentBrightness = constrain(brightness, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    dma_display->setBrightness8(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);
}

// A stale screen shows everything at a quarter brightness. Masking after the shift keeps
// each component's bits from bleeding into the one below it.
uint32_t dimColorQuarter(uint32_t color)
{
    return (color >> 2) & 0x3F3F3F;
}

// The panel has no accented glyphs in either font, so an accented name is drawn as its
// closest ASCII letter. Callers must pass both UTF-8 bytes: 'e' acute is C3 A9 and the
// copyright sign is C2 A9, so the continuation byte alone does not identify the character.
// An unknown C3 sequence becomes '?' and anything else is dropped, which is what the panel
// already did before this was a shared table.
char utf8FrenchToAscii(uint8_t leadByte, uint8_t continuationByte)
{
    if (leadByte != 0xC3)
    {
        return 0;
    }

    switch (continuationByte)
    {
        case 0x80: case 0x81: case 0x82: case 0x83: case 0x84: case 0x85: return 'A';
        case 0x87: return 'C';
        case 0x88: case 0x89: case 0x8A: case 0x8B: return 'E';
        case 0x8C: case 0x8D: case 0x8E: case 0x8F: return 'I';
        case 0x91: return 'N';
        case 0x92: case 0x93: case 0x94: case 0x95: case 0x96: return 'O';
        case 0x99: case 0x9A: case 0x9B: case 0x9C: return 'U';
        case 0xA0: case 0xA1: case 0xA2: case 0xA3: case 0xA4: case 0xA5: return 'a';
        case 0xA7: return 'c';
        case 0xA8: case 0xA9: case 0xAA: case 0xAB: return 'e';
        case 0xAC: case 0xAD: case 0xAE: case 0xAF: return 'i';
        case 0xB1: return 'n';
        case 0xB2: case 0xB3: case 0xB4: case 0xB5: case 0xB6: return 'o';
        case 0xB9: case 0xBA: case 0xBB: case 0xBC: return 'u';
        default: return '?';
    }
}

// Must advance exactly like printTextWithSpecialChars, or a scrolling string is measured
// against a width it never occupies: 6 px per drawn character, 4 px for the degree glyph,
// nothing for bytes the panel drops.
int16_t calculateTextWidth(const char* text) {
    const uint8_t charWidth = 6;
    int16_t totalWidth = 0;

    const uint8_t* ptr = (const uint8_t*)text;
    while (*ptr) {
        uint8_t c = *ptr;

        if ((c == 0xC2 && *(ptr + 1) == 0xB0) || c == 0xB0) {
            totalWidth += 4;
            ptr += (c == 0xB0) ? 1 : 2;
            continue;
        }

        if (c == 0xC3 && *(ptr + 1)) {
            totalWidth += charWidth;
            ptr += 2;
            continue;
        }

        if (c >= 32 && c <= 126) {
            totalWidth += charWidth;
        }
        ptr++;
    }

    return totalWidth;
}

// TomThumb is not monospaced: '1' advances 3 px and space 2 px where most
// glyphs advance 4, so a strlen-based estimate misplaces right-aligned and
// centred strings and makes them jitter as their digits change.
int16_t calculateTomThumbTextWidth(const char* text)
{
    int16_t totalWidth = 0;
    const uint8_t* character = (const uint8_t*)text;

    while (*character)
    {
        uint8_t characterCode = *character;

        if (characterCode == 0xC3 && *(character + 1))
        {
            characterCode = (uint8_t)utf8FrenchToAscii(characterCode, *(character + 1));
            character++;
        }

        if (characterCode >= 0x20 && characterCode <= 0x7E)
        {
            totalWidth += (int16_t)pgm_read_byte(&TomThumbGlyphs[characterCode - 0x20].xAdvance);
        }
        character++;
    }

    return totalWidth;
}

// One three-phase run for every scrolling text on screen: pause at the start, step one pixel
// per SCROLL_SPEED, pause at the end, rewind. Returns whether the caller has to repaint.
bool scrollStateAdvance(ScrollState& state, unsigned long now) {
    if (!state.needsScroll) return false;

    switch (state.scrollPhase) {
        case 0:  // pause_start
            if (now - state.lastScrollTime >= SCROLL_PAUSE) {
                state.scrollPhase = 1;
                state.lastScrollTime = now;
            }
            return false;

        case 1:  // scrolling
            if (now - state.lastScrollTime < SCROLL_SPEED) return false;
            state.lastScrollTime = now;
            state.scrollOffset++;
            if (state.scrollOffset >= state.textWidth - state.availableWidth + 10) {
                state.scrollPhase = 2;
            }
            return true;

        case 2:  // pause_end
            if (now - state.lastScrollTime >= SCROLL_PAUSE) {
                state.scrollOffset = 0;
                state.scrollPhase = 0;
                state.lastScrollTime = now;
            }
            return false;
    }

