nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, 0xFFFF);
            dma_display->drawPixel(dx, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 2, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 1, dy + 2, 0xFFFF);
            cursorX += 4;
            ptr++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3 && *(ptr + 1)) {
            dma_display->print(utf8FrenchToAscii(c, *(ptr + 1)));
            cursorX += charWidth;
            ptr += 2;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
        }
        // Skip other non-printable characters

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// Draw text with per-segment coloring (NULL font, 6px/char)
// segmentCount==0: uses defaultColor and delegates to printTextWithSpecialChars
// segmentCount>0: switches color at segment boundaries
void printTextWithSegments(const char* text, int16_t x, int16_t y,
                           uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        uint8_t r = (defaultColor >> 16) & 0xFF;
        uint8_t g = (defaultColor >> 8) & 0xFF;
        uint8_t b = defaultColor & 0xFF;
        dma_display->setTextColor(dma_display->color565(r, g, b));
        printTextWithSpecialChars(text, x, y);
        return;
    }

    const uint8_t charWidth = 6;
    int16_t cursorX = x;
    dma_display->setCursor(cursorX, y);

    // Start with first segment color or default
    uint8_t currentSegment = 0;
    uint32_t currentColor = (segmentCount > 0) ? segments[0].color : defaultColor;
    uint8_t r = (currentColor >> 16) & 0xFF;
    uint8_t g = (currentColor >> 8) & 0xFF;
    uint8_t b = currentColor & 0xFF;
    uint16_t color565 = dma_display->color565(r, g, b);
    dma_display->setTextColor(color565);

    uint8_t charIndex = 0;  // Visual char index (UTF-8 multi-byte = 1 visual char)
    const uint8_t* ptr = (const uint8_t*)text;

    while (*ptr) {
        // Check if we need to switch to next segment color
        if (currentSegment + 1 < segmentCount && charIndex >= segments[currentSegment + 1].offset) {
            currentSegment++;
            currentColor = segments[currentSegment].color;
            r = (currentColor >> 16) & 0xFF;
            g = (currentColor >> 8) & 0xFF;
            b = currentColor & 0xFF;
            color565 = dma_display->color565(r, g, b);
            dma_display->setTextColor(color565);
        }

        uint8_t c = *ptr;

        // Handle UTF-8 degree symbol (C2 B0)
        if (c == 0xC2 && *(ptr + 1) == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr++;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3 && *(ptr + 1)) {
            dma_display->print(utf8FrenchToAscii(c, *(ptr + 1)));
            cursorX += charWidth;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
            charIndex++;
        }

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// The default 5x7 font occupies a 6x8 cell: five columns of glyph plus one of spacing.
#define TEXT_CELL_WIDTH  6
#define TEXT_CELL_HEIGHT 8

// Adafruit_GFX draws a character whole or not at all, so one that straddles a bound goes
// through a stencil first.
void drawCharacterWithinBounds(char character, int16_t x, int16_t y,
                               int16_t boundLeft, int16_t boundRight, uint16_t color) {
    static GFXcanvas1 glyphStencil(TEXT_CELL_WIDTH, TEXT_CELL_HEIGHT);

    // Opaque draw, so every cell is written and nothing carries over from the last character
    glyphStencil.drawChar(0, 0, character, 1, 0, 1);

    for (int16_t column = 0; column < TEXT_CELL_WIDTH; column++) {
        int16_t panelX = x + column;
        if (panelX < boundLeft || panelX >= boundRight) continue;

        for (int16_t row = 0; row < TEXT_CELL_HEIGHT; row++) {
            if (glyphStencil.getPixel(column, row)) {
                dma_display->drawPixel(panelX, y + row, color);
            }
        }
    }
}

// Draws text the way printTextWithSpecialChars does, confined to [boundLeft, boundRight).
// The panel has no clip rectangle, and the alternative - painting the row whole and wiping
// what overflows - leaves those pixels lit for as long as the rest of the row takes to draw,
// which the DMA scans out as an artefact over whatever the row slides behind.
void printTextWithinBounds(const char* text, int16_t x, int16_t y,
                           int16_t boundLeft, int16_t boundRight, uint32_t color) {
    uint16_t color565 = dma_display->color565((color >> 16) & 0xFF,
                                              (color >> 8) & 0xFF,
                                              color & 0xFF);
    dma_display->setTextColor(color565);

    int16_t cursorX = x;
    const uint8_t* ptr = (const uint8_t*)text;

    // Advances exactly like printTextWithSpecialChars, so a scrolling string is drawn against
    // the width calculateTextWidth measured for it
    while (*ptr && cursorX < boundRight) {
        if ((*ptr == 0xC2 && *(ptr + 1) == 0xB0) || *ptr == 0xB0) {
            static const int8_t degreePixels[4][2] = {{1, 0}, {0, 1}, {2, 1}, {1, 2}};
            for (uint8_t i = 0; i < 4; i++) {
                int16_t pixelX = cursorX + degreePixels[i][0];
                if (pixelX >= boundLeft && pixelX < boundRight) {
                    dma_display->drawPixel(pixelX, y - 6 + degreePixels[i][1], color565);
                }
            }
            ptr += (*ptr == 0xB0) ? 1 : 2;
            cursorX += 4;
            continue;
        }

        char character;
        if (*ptr == 0xC3 && *(ptr + 1)) {
            character = utf8FrenchToAscii(*ptr, *(ptr + 1));
            ptr += 2;
        } else if (*ptr >= 32 && *ptr <= 126) {
            character = (char)*ptr;
            ptr++;
        } else {
            ptr++;  // Dropped, and measured as dropped
            continue;
        }

