nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Check if file exists
    if (!LittleFS.exists(filePath)) {
        Serial.printf("[ICON] File not found: %s\n", filePath);
        return nullptr;
    }

    // Find a cache slot
    int8_t slot = findLRUSlot();
    if (slot < 0) {
        Serial.println("[ICON] No cache slots available");
        return nullptr;
    }

    CachedIcon* cached = &iconCache[slot];

    // Open file
    File file = LittleFS.open(filePath, "r");
    if (!file) {
        Serial.printf("[ICON] Failed to open: %s\n", filePath);
        return nullptr;
    }

    // Read file into buffer
    size_t fileSize = file.size();
    uint8_t* fileBuffer = (uint8_t*)malloc(fileSize);
    if (!fileBuffer) {
        file.close();
        Serial.println("[ICON] Failed to allocate file buffer");
        return nullptr;
    }
    file.read(fileBuffer, fileSize);
    file.close();

    // Initialize PNG decoder
    int rc = png.openRAM(fileBuffer, fileSize, pngDrawCallback);
    if (rc != PNG_SUCCESS) {
        free(fileBuffer);
        Serial.printf("[ICON] PNG open failed: %d\n", rc);
        return nullptr;
    }

    // Get dimensions (limit to 32x32 to preserve RAM)
    uint8_t width = min((int)png.getWidth(), 32);
    uint8_t height = min((int)png.getHeight(), 32);

    // Allocate pixel buffer
    cached->pixels = (uint16_t*)malloc(width * height * sizeof(uint16_t));
    if (!cached->pixels) {
        png.close();
        free(fileBuffer);
        Serial.println("[ICON] Failed to allocate pixel buffer");
        return nullptr;
    }

    // Set up decode target
    pngDecodeTarget = cached->pixels;
    pngDecodeWidth = width;

    // Clear buffer
    memset(cached->pixels, 0, width * height * sizeof(uint16_t));

    // Decode PNG
    rc = png.decode(NULL, 0);
    png.close();
    free(fileBuffer);

    if (rc != PNG_SUCCESS) {
        free(cached->pixels);
        cached->pixels = nullptr;
        Serial.printf("[ICON] PNG decode failed: %d\n", rc);
        return nullptr;
    }

    // Update cache entry
    strlcpy(cached->name, name, sizeof(cached->name));
    cached->width = width;
    cached->height = height;
    cached->valid = true;
    cached->lastUsed = millis();

    Serial.printf("[ICON] Loaded: %s (%dx%d)\n", name, width, height);
    return cached;
}

bool isFailedIconDownload(const char* name) {
    unsigned long now = millis();
    for (uint8_t i = 0; i < MAX_FAILED_ICON_DOWNLOADS; i++) {
        if (failedIconDownloads[i].name[0] != '\0' &&
            strcmp(failedIconDownloads[i].name, name) == 0 &&
            (now - failedIconDownloads[i].failedAt) < FAILED_ICON_RETRY_DELAY) {
            return true;
        }
    }
    return false;
}

void addFailedIconDownload(const char* name) {
    // Find oldest entry to evict
    uint8_t oldestIndex = 0;
    unsigned long oldestTime = ULONG_MAX;
    for (uint8_t i = 0; i < MAX_FAILED_ICON_DOWNLOADS; i++) {
        if (failedIconDownloads[i].name[0] == '\0') {
            oldestIndex = i;
            break;
        }
        if (failedIconDownloads[i].failedAt < oldestTime) {
            oldestTime = failedIconDownloads[i].failedAt;
            oldestIndex = i;
        }
    }
    strlcpy(failedIconDownloads[oldestIndex].name, name, sizeof(failedIconDownloads[oldestIndex].name));
    failedIconDownloads[oldestIndex].failedAt = millis();
}

// Cache-only lookup, for callers that run every frame: a miss must not cost a filesystem
// read or a LaMetric download. Refreshes lastUsed so a displayed icon is not the first
// candidate for eviction.
CachedIcon* getCachedIcon(const char* name) {
    if (!name || strlen(name) == 0) return nullptr;

    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        if (iconCache[i].valid && strcmp(iconCache[i].name, name) == 0) {
            iconCache[i].lastUsed = millis();
            return &iconCache[i];
        }
    }

    return nullptr;
}

CachedIcon* getIcon(const char* name) {
    if (!name || strlen(name) == 0) return nullptr;

    CachedIcon* cached = getCachedIcon(name);
    if (cached) return cached;

    // Not in cache, try loading from filesystem
    CachedIcon* result = loadIcon(name);
    if (result) return result;

    // Auto-download LaMetric icons on demand
    if (strncmp(name, "lm_", 3) == 0) {
        const char* idStr = name + 3;
        // Validate that the rest is numeric
        bool isNumeric = (*idStr != '\0');
        for (const char* p = idStr; *p; p++) {
            if (*p < '0' || *p > '9') { isNumeric = false; break; }
        }
        if (isNumeric && !isFailedIconDownload(name)) {
            uint32_t iconId = strtoul(idStr, nullptr, 10);
            Serial.printf("[ICON] Auto-downloading LaMetric icon: %s (id=%u)\n", name, iconId);
            if (downloadLaMetricIcon(iconId, name)) {
                return loadIcon(name);
            } else {
                addFailedIconDownload(name);
                Serial.printf("[ICON] Download failed, blacklisted for %ds: %s\n",
                              FAILED_ICON_RETRY_DELAY / 1000, name);
            }
        }
    }

    return nullptr;
}

void drawIcon(CachedIcon* icon, int16_t x, int16_t y) {
    if (!icon || !icon->valid || !icon->pixels) return;

    // Upscale x2 for small icons (8x8 -> 16x16)
    uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;

    for (uint8_t py = 0; py < icon->height; py++) {
        for (uint8_t px = 0; px < icon->width; px++) {
            uint16_t pixel = icon->pixels[py * icon->width + px];
            if (pixel != 0) {  // Skip transparent/black pixels
                if (scale == 2) {
                    // Draw 2x2 block for each pixel
                    int16_t dx = x + px * 2;
                    int16_t dy = y + py * 2;
                    dma_display->drawPixel(dx, dy, pixel);
                    dma_display->drawPixel(dx + 1, dy, pixel);
                    dma_display->drawPixel(dx, dy + 1, pixel);
                    dma_display->drawPixel(dx + 1, dy + 1, pixel);
                } else {
                    dma_display->drawPixel(x + px, y + py, pixel);
                }
            }
        }
    }
}

void invalidateCachedIcon(const char* name) {
    if (!name || strlen(name) == 0) return;

    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        if (iconCache[i].valid && strcmp(iconCache[i].name, name) == 0) {
            if (iconCache[i].pixels) {
                free(iconCache[i].pixels);
                iconCache[i].pixels = nullptr;
            }
            iconCache[i].valid = false;
            iconCache[i].name[0] = '\0';
            Serial.printf("[ICON] Invalidated cached icon: %s\n", name);
            return;
        }
    }
}

bool validatePngHeader(const uint8_t* data, size_t len) {
    if (len < 8) return false;
    // PNG magic bytes: 89 50 4E 47 0D 0A 1A 0A
    return (data[0] == 0x89 && data[1] == 0x50 && data[2] == 0x4E && data[3] == 0x47 &&
            data[4] == 0x0D && data[5] == 0x0A && data[6] == 0x1A && data[7] == 0x0A);
}

bool validateGifHeader(const uint8_t* data, size_t len) {
    if (len < 6) return false;
    // GIF magic: "GIF87a" or "GIF89a"
    return (data[0] == 'G' && data[1] == 'I' && data[2] == 'F' &&
            data[3] == '8' && (data[4] == '7' || data[4] == '9') && data[5] == 'a');
}

bool downloadLaMetricIcon(uint32_t iconId, const char* saveName) {
    if (!filesystemReady) {
        Serial.println("[LAMETRIC] Filesystem not ready");
        return false;
    }

    WiFiClientSecure client;
    client.setInsecure();  // Skip certificate verification for simplicity

    HTTPClient https;
    bool isPng = true;

    // Try PNG first
    String url = "https://" LAMETRIC_API_HOST LAMETRIC_ICON_PATH + String(iconId) + ".png";
    Serial.printf("[LAMETRIC] Trying PNG: %s\n", url.c_str());

    if (!https.begin(client, url)) {
        Serial.println("[LAMETRIC] HTTPS begin failed");
        return false;
    }

    int httpCode = https.GET();

    // If PNG not found, try GIF
    if (httpCode != HTTP_CODE_OK) {
        https.end();
        url = "https://" LAMETRIC_API_HOST LAMETRIC_ICON_PATH + String(iconId) + ".gif";
        Serial.printf("[LAMETRIC] Trying GIF: %s\n", url.c_str());

        if (!https.begin(client, url)) {
            Serial.println("[LAMETRIC] HTTPS begin failed");
            return false;
        }

        httpCode = https.GET();
        isPng = false;
    }

    if (httpCode != HTTP_CODE_OK) {
        Serial.printf("[LAMETRIC] HTTP error: %d\n", httpCode);
        https.end();
        return false;
    }

    // Check file size
    int contentLength = https.getSize();
    if (contentLength > MAX_ICON_SIZE) {
        Serial.printf("[LAMETRIC] Icon too large: %d bytes\n", contentLength);
        https.end();
        return false;
    }

