nicolas-codemate/esp32-pixelcast/src/main.cpp
            bool hasWeatherDuration = !doc["weatherDuration"].isNull();
            uint32_t requestedWeatherDuration = 0;
            if (hasWeatherDuration) {
                requestedWeatherDuration = doc["weatherDuration"].as<uint32_t>();
                if (requestedWeatherDuration < (uint32_t)MIN_WEATHER_DURATION ||
                    requestedWeatherDuration > (uint32_t)MAX_WEATHER_DURATION) {
                    char errorMessage[96];
                    snprintf(errorMessage, sizeof(errorMessage),
                             "{\"error\":\"weatherDuration must be between %d and %d ms\"}",
                             MIN_WEATHER_DURATION, MAX_WEATHER_DURATION);
                    request->send(400, "application/json", errorMessage);
                    return;
                }
            }

            const char* requestedTzPosix = nullptr;
            if (!ntpUpdate.isNull() && ntpUpdate["tz_posix"].is<const char*>()) {
                requestedTzPosix = ntpUpdate["tz_posix"].as<const char*>();
                size_t tzLen = strlen(requestedTzPosix);
                if (tzLen == 0 || tzLen >= sizeof(settings.tzPosix)) {
                    request->send(400, "application/json", "{\"error\":\"tz_posix length invalid\"}");
                    return;
                }
            }

            if (!doc["brightness"].isNull()) {
                settings.brightness = doc["brightness"].as<uint8_t>();
                displaySetBrightness(settings.brightness);
            }
            if (!doc["autoRotate"].isNull()) {
                settings.autoRotate = doc["autoRotate"].as<bool>();
                appRotationEnabled = settings.autoRotate;
            }
            if (!doc["defaultDuration"].isNull()) {
                settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
            }
            if (hasWeatherDuration) {
                settings.weatherDuration = (uint16_t)requestedWeatherDuration;
                weatherClockApplyDuration(settings.weatherDuration);
            }

            bool ntpChanged = false;
            if (!ntpUpdate.isNull()) {
                if (!ntpUpdate["offset"].isNull() || !ntpUpdate["daylight_offset"].isNull()) {
                    Serial.println("[NTP] Legacy ntp.offset/daylight_offset ignored, use ntp.tz_posix");
                }
                if (requestedTzPosix) {
                    strlcpy(settings.tzPosix, requestedTzPosix, sizeof(settings.tzPosix));
                    Serial.printf("[NTP] tz_posix updated to %s\n", settings.tzPosix);
                    ntpChanged = true;
                }
                if (ntpUpdate["server"].is<const char*>()) {
                    strlcpy(settings.ntpServer, ntpUpdate["server"].as<const char*>(), sizeof(settings.ntpServer));
                    Serial.printf("[NTP] server updated to %s\n", settings.ntpServer);
                    ntpChanged = true;
                }
            }
            if (ntpChanged) {
                configTzTime(settings.tzPosix, settings.ntpServer);
            }

            saveSettings();
            Serial.println("[API] Settings updated");
            request->send(200, "application/json", "{\"success\":true}");
        });
    webServer.addHandler(settingsHandler);

    // GET /api/weather - Return current weather data
    webServer.on("/api/weather", HTTP_GET, [](AsyncWebServerRequest *request) {
        JsonDocument doc;

        doc["valid"] = weatherData.valid;

        if (weatherData.valid) {
            unsigned long ageMs = millis() - weatherData.lastUpdate;
            doc["age"] = ageMs / 1000;
            doc["stale"] = (ageMs > 3600000);

            JsonObject current = doc["current"].to<JsonObject>();
            current["icon"] = weatherData.currentIcon;
            current["temp"] = weatherData.currentTemp;
            current["temp_min"] = weatherData.currentTempMin;
            current["temp_max"] = weatherData.currentTempMax;
            current["humidity"] = weatherData.currentHumidity;

            JsonArray forecastArr = doc["forecast"].to<JsonArray>();
            for (int i = 0; i < weatherData.forecastCount; i++) {
                JsonObject fc = forecastArr.add<JsonObject>();
                fc["day"] = weatherData.forecast[i].dayName;
                fc["icon"] = weatherData.forecast[i].icon;
                fc["temp_min"] = weatherData.forecast[i].tempMin;
                fc["temp_max"] = weatherData.forecast[i].tempMax;
            }

            if (weatherData.today.hourCount > 0) {
                JsonObject today = doc["today"].to<JsonObject>();

                JsonArray hoursArr = today["hours"].to<JsonArray>();
                for (uint8_t i = 0; i < weatherData.today.hourCount; i++) {
                    JsonObject hourObj = hoursArr.add<JsonObject>();
                    hourObj["h"] = weatherData.today.hours[i].hour;
                    hourObj["temp"] = weatherData.today.hours[i].temp;
                    hourObj["pop"] = weatherData.today.hours[i].precipProbability;
                    hourObj["precip"] = weatherData.today.hours[i].precipTenthsOfMm;
                }

                JsonArray segmentsArr = today["segments"].to<JsonArray>();
                for (uint8_t i = 0; i < weatherData.today.segmentCount; i++) {
                    JsonObject segmentObj = segmentsArr.add<JsonObject>();
                    segmentObj["from"] = weatherData.today.segments[i].fromHour;
                    segmentObj["to"] = weatherData.today.segments[i].toHour;
                    segmentObj["icon"] = weatherData.today.segments[i].icon;
                }
            }
        }

        String output;
        serializeJson(doc, output);
        request->send(200, "application/json", output);
    });

    // POST /api/weather - Update weather data
    AsyncCallbackJsonWebHandler* weatherHandler = new AsyncCallbackJsonWebHandler("/api/weather",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /weather handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

