nicolas-codemate/esp32-pixelcast/src/main.cpp
    weatherData.lastUpdate = millis();
    weatherData.valid = true;

    Serial.printf("[MQTT] Weather updated: %d C, %d%% humidity\n",
                  weatherData.currentTemp, weatherData.currentHumidity);
}

void mqttHandleTracker(const char* name, JsonObject& doc) {
    // Allocate or find existing tracker
    TrackerData* tracker = trackerAllocate(name);
    if (!tracker) {
        Serial.printf("[MQTT] No tracker slot available for '%s'\n", name);
        return;
    }

    // Parse fields
    if (!doc["symbol"].isNull()) {
        strlcpy(tracker->symbol, doc["symbol"] | "", sizeof(tracker->symbol));
    }
    if (!doc["icon"].isNull()) {
        strlcpy(tracker->icon, doc["icon"] | "", sizeof(tracker->icon));
    }
    if (!doc["currency"].isNull()) {
        strlcpy(tracker->currencySymbol, doc["currency"] | "", sizeof(tracker->currencySymbol));
    }
    if (!doc["value"].isNull()) {
        tracker->currentValue = doc["value"].as<float>();
    }
    if (!doc["change"].isNull()) {
        tracker->changePercent = doc["change"].as<float>();
    }
    if (!doc["bottomText"].isNull()) {
        parseTextFieldWithSegments(doc["bottomText"], tracker->bottomText,
                                   sizeof(tracker->bottomText),
                                   tracker->bottomTextSegments,
                                   &tracker->bottomTextSegmentCount,
                                   TRACKER_BOTTOM_COLOR);
    }
    if (!doc["sparklinePeriod"].isNull()) {
        strlcpy(tracker->sparklinePeriod, doc["sparklinePeriod"] | "", sizeof(tracker->sparklinePeriod));
    }

    tracker->symbolColor = parseColorValue(doc["symbolColor"], tracker->symbolColor);
    tracker->sparklineColor = parseColorValue(doc["sparklineColor"], tracker->sparklineColor);

    // Parse sparkline data (float array -> scaled uint16)
    if (doc["sparkline"].is<JsonArray>()) {
        JsonArray sparkArr = doc["sparkline"];
        uint8_t count = min((int)sparkArr.size(), (int)MAX_SPARKLINE_POINTS);

        if (count >= 2) {
            float minVal = sparkArr[0].as<float>();
            float maxVal = minVal;
            for (uint8_t i = 1; i < count; i++) {
                float v = sparkArr[i].as<float>();
                if (v < minVal) minVal = v;
                if (v > maxVal) maxVal = v;
            }

            float range = maxVal - minVal;
            if (range < 0.0001f) range = 1.0f;

            for (uint8_t i = 0; i < count; i++) {
                float normalized = (sparkArr[i].as<float>() - minVal) / range;
                tracker->sparkline[i] = (uint16_t)(normalized * 65535.0f);
            }
            tracker->sparklineCount = count;
        }
    }

    tracker->lastUpdate = millis();

    // Register/update app in rotation
    char appId[32];
    snprintf(appId, sizeof(appId), "%s%s", TRACKER_ID_PREFIX, name);
    uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_APP_DURATION;
    appAdd(appId, tracker->symbol, tracker->icon, 0xFFFFFF,
           duration, 0, 0, false);

    Serial.printf("[MQTT] Tracker updated: %s (%s = %.2f)\n",
                  name, tracker->symbol, tracker->currentValue);
}

void mqttHandleTrackerDelete(const char* name) {
    if (trackerRemove(name)) {
        Serial.printf("[MQTT] Tracker '%s' deleted\n", name);
    } else {
        Serial.printf("[MQTT] Tracker '%s' not found\n", name);
    }
}

void mqttHandleSettings(JsonObject& doc) {
    if (!doc["brightness"].isNull()) {
        settings.brightness = doc["brightness"].as<uint8_t>();
        displaySetBrightness(settings.brightness);
    }
    if (!doc["autoRotate"].isNull()) {
        settings.autoRotate = doc["autoRotate"].as<bool>();
        appRotationEnabled = settings.autoRotate;
    }
    if (!doc["defaultDuration"].isNull()) {
        settings.defaultDuration = doc["defaultDuration"].as<uint16_t>();
    }
    if (!doc["weatherDuration"].isNull()) {
        uint32_t requestedWeatherDuration = doc["weatherDuration"].as<uint32_t>();
        settings.weatherDuration = constrain(requestedWeatherDuration,
                                             (uint32_t)MIN_WEATHER_DURATION,
                                             (uint32_t)MAX_WEATHER_DURATION);
        weatherClockApplyDuration(settings.weatherDuration);
    }

    saveSettings();
    Serial.println("[MQTT] Settings updated");
}

void mqttHandleReboot() {
    Serial.println("[MQTT] Reboot requested");
    pendingReboot = true;
    rebootRequestTime = millis();
}

// ============================================================================
// Filesystem Functions
// ============================================================================

void setupFilesystem() {
    if (!LittleFS.begin(true)) {
        Serial.println("[FS] LittleFS mount failed!");
        filesystemReady = false;
        return;
    }

    filesystemReady = true;
    Serial.printf("[FS] LittleFS mounted, total: %d bytes, used: %d bytes\n",
        LittleFS.totalBytes(), LittleFS.usedBytes());

    ensureDirectories();
}

bool ensureDirectories() {
    if (!filesystemReady) return false;

    const char* dirs[] = {FS_ICONS_PATH, FS_GIFS_PATH, FS_CONFIG_PATH};
    bool allOk = true;

    for (const char* dir : dirs) {
        if (!LittleFS.exists(dir)) {
            if (LittleFS.mkdir(dir)) {
                Serial.printf("[FS] Created directory: %s\n", dir);
            } else {
                Serial.printf("[FS] Failed to create directory: %s\n", dir);
                allOk = false;
            }
        }
    }

    return allOk;
}

void initDefaultSettings() {
    settings.brightness = DEFAULT_BRIGHTNESS;
    settings.autoRotate = true;
    settings.defaultDuration = DEFAULT_APP_DURATION;
    settings.weatherDuration = DEFAULT_WEATHER_DURATION;

    strlcpy(settings.ntpServer, NTP_SERVER, sizeof(settings.ntpServer));
    strlcpy(settings.tzPosix, DEFAULT_TZ_POSIX, sizeof(settings.tzPosix));

    settings.clockEnabled = true;
    settings.clockFormat24h = true;
    settings.clockShowSeconds = true;
    settings.clockColor = 0xFFFFFF;

