nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Parse text field (handles string and [{t,c},...] array from persistence)
        char parsedText[64] = "";
        TextSegment textSegs[MAX_TEXT_SEGMENTS];
        uint8_t textSegCount = 0;
        parseTextFieldWithSegments(appObj["text"], parsedText, sizeof(parsedText),
                                   textSegs, &textSegCount, textColor);

        if (strlen(id) > 0) {
            int8_t result = appAdd(id, parsedText, icon, textColor,
                                   duration, lifetime, priority, false);
            if (result >= 0) {
                // Restore text segments
                memcpy(apps[result].textSegments, textSegs, sizeof(textSegs));
                apps[result].textSegmentCount = textSegCount;
                // Restore label with segments
                parseTextFieldWithSegments(appObj["label"], apps[result].label,
                                           sizeof(apps[result].label),
                                           apps[result].labelSegments,
                                           &apps[result].labelSegmentCount, textColor);
                // Restore multi-zone data if present
                JsonArray zonesArr = appObj["zones"].as<JsonArray>();
                if (!zonesArr.isNull() && zonesArr.size() >= 2) {
                    appSetZones(result, zonesArr);
                }
                loadedCount++;
            }
        }
    }

    Serial.printf("[APPS] Loaded %d custom apps from storage\n", loadedCount);
    return loadedCount > 0;
}

bool saveApps() {
    if (!filesystemReady) {
        Serial.println("[APPS] Filesystem not ready, cannot save apps");
        return false;
    }

    JsonDocument doc;
    doc["version"] = 1;
    JsonArray appsArray = doc["apps"].to<JsonArray>();

    int savedCount = 0;
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && !apps[i].isSystem) {
            JsonObject appObj = appsArray.add<JsonObject>();
            appObj["id"] = apps[i].id;
            appObj["icon"] = apps[i].icon;
            appObj["textColor"] = apps[i].textColor;
            appObj["duration"] = apps[i].duration;
            appObj["lifetime"] = apps[i].lifetime;
            appObj["priority"] = apps[i].priority;
            // Serialize text and label in polymorphic format
            serializeTextField(appObj, "text", apps[i].text,
                               apps[i].textSegments, apps[i].textSegmentCount);
            if (apps[i].label[0] != '\0') {
                serializeTextField(appObj, "label", apps[i].label,
                                   apps[i].labelSegments, apps[i].labelSegmentCount);
            }

            // Serialize multi-zone data
            if (apps[i].zoneCount >= 2) {
                appObj["zoneCount"] = apps[i].zoneCount;
                JsonArray zonesArr = appObj["zones"].to<JsonArray>();
                // Zone 0 = main app fields (text/icon/textColor/label)
                JsonObject z0 = zonesArr.add<JsonObject>();
                serializeTextField(z0, "text", apps[i].text,
                                   apps[i].textSegments, apps[i].textSegmentCount);
                z0["icon"] = apps[i].icon;
                if (apps[i].label[0] != '\0') {
                    serializeTextField(z0, "label", apps[i].label,
                                       apps[i].labelSegments, apps[i].labelSegmentCount);
                }
                char z0ColorHex[8];
                formatColorHex(apps[i].textColor, z0ColorHex, sizeof(z0ColorHex));
                z0["color"] = z0ColorHex;
                // Zones 1..N stored in app->zones[0..N-1]
                for (uint8_t z = 1; z < apps[i].zoneCount; z++) {
                    JsonObject zObj = zonesArr.add<JsonObject>();
                    serializeTextField(zObj, "text", apps[i].zones[z - 1].text,
                                       apps[i].zones[z - 1].textSegments,
                                       apps[i].zones[z - 1].textSegmentCount);
                    zObj["icon"] = apps[i].zones[z - 1].icon;
                    if (apps[i].zones[z - 1].label[0] != '\0') {
                        serializeTextField(zObj, "label", apps[i].zones[z - 1].label,
                                           apps[i].zones[z - 1].labelSegments,
                                           apps[i].zones[z - 1].labelSegmentCount);
                    }
                    char zColorHex[8];
                    formatColorHex(apps[i].zones[z - 1].textColor, zColorHex, sizeof(zColorHex));
                    zObj["color"] = zColorHex;
                }
            }

            savedCount++;
        }
    }

    File file = LittleFS.open(FS_APPS_FILE, "w");
    if (!file) {
        Serial.println("[APPS] Failed to open apps file for writing");
        return false;
    }

    serializeJsonPretty(doc, file);
    file.close();

    Serial.printf("[APPS] Saved %d custom apps to storage\n", savedCount);
    return true;
}

// ============================================================================
// Application Manager Functions
// ============================================================================

void setupApps() {
    // Initialize app array
    memset(apps, 0, sizeof(apps));
    appCount = 0;
    currentAppIndex = -1;

    // Add system apps
    // NOTE: clock and date disabled while weatherclock is in development
    // if (settings.clockEnabled) {
    //     appAdd("clock", "Clock", "", settings.clockColor,
    //            settings.defaultDuration, 0, 0, true);
    //     Serial.println("[APPS] Clock app added");
    // }
    //
    // if (settings.dateEnabled) {
    //     appAdd("date", "Date", "", settings.dateColor,
    //            settings.defaultDuration, 0, 0, true);
    //     Serial.println("[APPS] Date app added");
    // }

    // WeatherClock system app (replaces clock+date when weather data is available)
    appAdd("weatherclock", "WeatherClock", "", settings.clockColor,
           settings.weatherDuration, 0, 1, true);
    Serial.println("[APPS] WeatherClock app added");

