nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Load persisted custom apps
    // NOTE: disabled during weatherclock development to avoid old "weather" app interference
    // loadApps();

    Serial.printf("[APPS] Initialized with %d apps\n", appCount);
    appRotationEnabled = settings.autoRotate;
}

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint16_t duration,
              uint32_t lifetime, int8_t priority, bool isSystem) {

    // Check if app with same ID exists
    int8_t existingIndex = appFind(id);
    if (existingIndex >= 0) {
        // Update existing app
        AppItem* app = &apps[existingIndex];
        strlcpy(app->text, text, sizeof(app->text));
        if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
        app->label[0] = '\0';  // Reset label (caller will set if needed)
        app->textColor = textColor;
        app->textSegmentCount = 0;
        app->labelSegmentCount = 0;
        app->duration = duration;
        app->lifetime = lifetime;
        app->priority = priority;
        app->createdAt = millis();
        app->active = true;
        // Reset zone data (caller will set via appSetZones if needed)
        app->zoneCount = 0;
        memset(app->zones, 0, sizeof(app->zones));
        Serial.printf("[APPS] Updated app: %s\n", id);
        // Persist non-system apps
        if (!app->isSystem) {
            saveApps();
        }
        return existingIndex;
    }

    // Find empty slot
    int8_t emptySlot = -1;
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (!apps[i].active) {
            emptySlot = i;
            break;
        }
    }

    if (emptySlot < 0) {
        Serial.println("[APPS] No empty slot available");
        return -1;
    }

    // Create new app
    AppItem* app = &apps[emptySlot];
    strlcpy(app->id, id, sizeof(app->id));
    strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    else app->icon[0] = '\0';
    app->label[0] = '\0';  // Initialize label (caller will set if needed)
    app->textColor = textColor;
    app->textSegmentCount = 0;
    app->labelSegmentCount = 0;
    app->duration = duration > 0 ? duration : settings.defaultDuration;
    app->lifetime = lifetime;
    app->createdAt = millis();
    app->priority = constrain(priority, -10, 10);
    app->active = true;
    app->isSystem = isSystem;
    // Initialize zone data (caller will set via appSetZones if needed)
    app->zoneCount = 0;
    memset(app->zones, 0, sizeof(app->zones));

    appCount++;
    Serial.printf("[APPS] Added app: %s (slot %d, total %d)\n", id, emptySlot, appCount);

    // Persist non-system apps
    if (!isSystem) {
        saveApps();
    }

    return emptySlot;
}

void appSetZones(int8_t appIndex, JsonArray zonesArray) {
    if (appIndex < 0 || appIndex >= MAX_APPS) return;

    AppItem* app = &apps[appIndex];
    uint8_t count = zonesArray.size();
    if (count < 2 || count > MAX_ZONES) return;

    app->zoneCount = count;

    // Zone 0 maps to the app's main text/icon/textColor/label fields
    JsonObject zone0 = zonesArray[0].as<JsonObject>();
    strlcpy(app->icon, zone0["icon"] | "", sizeof(app->icon));
    app->textColor = parseColorValue(zone0["color"], 0xFFFFFF);
    parseTextFieldWithSegments(zone0["text"], app->text, sizeof(app->text),
                               app->textSegments, &app->textSegmentCount, app->textColor);
    parseTextFieldWithSegments(zone0["label"], app->label, sizeof(app->label),
                               app->labelSegments, &app->labelSegmentCount, app->textColor);

    // Zones 1-3 map to app->zones[0..2]
    for (uint8_t i = 1; i < count && i < MAX_ZONES; i++) {
        JsonObject zoneObj = zonesArray[i].as<JsonObject>();
        strlcpy(app->zones[i - 1].icon, zoneObj["icon"] | "", sizeof(app->zones[0].icon));
        app->zones[i - 1].textColor = parseColorValue(zoneObj["color"], 0xFFFFFF);
        parseTextFieldWithSegments(zoneObj["text"], app->zones[i - 1].text,
                                   sizeof(app->zones[0].text),
                                   app->zones[i - 1].textSegments,
                                   &app->zones[i - 1].textSegmentCount,
                                   app->zones[i - 1].textColor);
        parseTextFieldWithSegments(zoneObj["label"], app->zones[i - 1].label,
                                   sizeof(app->zones[0].label),
                                   app->zones[i - 1].labelSegments,
                                   &app->zones[i - 1].labelSegmentCount,
                                   app->zones[i - 1].textColor);
    }

    Serial.printf("[APPS] Set %d zones for app: %s\n", count, app->id);

    // Persist non-system apps
    if (!app->isSystem) {
        saveApps();
    }
}

bool appRemove(const char* id) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (app->isSystem) {
        Serial.printf("[APPS] Cannot remove system app: %s\n", id);
        return false;
    }

    app->active = false;
    appCount--;

    // If removing current app, move to next
    if (currentAppIndex == index) {
        currentAppIndex = -1;
    }

    Serial.printf("[APPS] Removed app: %s\n", id);

    // Persist the removal
    saveApps();

    return true;
}

bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (text) strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    if (textColor != 0) app->textColor = textColor;
    app->createdAt = millis();

    Serial.printf("[APPS] Updated app: %s\n", id);
    return true;
}

void weatherClockApplyDuration(uint16_t durationMs)
{
    int8_t weatherClockIndex = appFind("weatherclock");
    if (weatherClockIndex < 0) return;

    apps[weatherClockIndex].duration = durationMs;
    Serial.printf("[APPS] WeatherClock duration set to %u ms\n", durationMs);
}

int8_t appFind(const char* id) {
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && strcmp(apps[i].id, id) == 0) {
            return i;
        }
    }
    return -1;
}

